# Pandas

Pandas is a library of python that simplifies task of data manipulation for tabular type data.

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\desktop\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\desktop\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\desktop\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\desktop\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\desktop\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\desktop\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [5]:
import pandas as pd

In [6]:
data1={"Name":["Manish","Dev","Demi"],"Age":[18,26,27],"Gender":["Female","Male","Male"]}

In [7]:
data1

{'Name': ['Manish', 'Dev', 'Demi'],
 'Age': [18, 26, 27],
 'Gender': ['Female', 'Male', 'Male']}

In [8]:
df1=pd.DataFrame(data=data1)

In [9]:
df1

     Name  Age  Gender
0  Manish   18  Female
1     Dev   26    Male
2    Demi   27    Male

In [10]:
type(df1)

pandas.core.frame.DataFrame

In [11]:
x=df1['Name']

In [12]:
type(x)

pandas.core.series.Series

In [13]:
x

0    Manish
1       Dev
2      Demi
Name: Name, dtype: object

In [14]:
l1=[1,2,3,4,5]

In [15]:
pd.Series(data=l1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [16]:
type(l1)

list

In [17]:
ages=pd.Series([18,19,20,21],name="Age")

In [18]:
ages

0    18
1    19
2    20
3    21
Name: Age, dtype: int64

In [19]:
df1

     Name  Age  Gender
0  Manish   18  Female
1     Dev   26    Male
2    Demi   27    Male

In [20]:
df1['Age'].max()

27

In [21]:
df1['Age'].min()

18

In [22]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]

In [23]:
df2=pd.DataFrame(country,capital)

In [24]:
df2

                      0
Brasilia         Brazil
Moscow           Russia
New Delhi         India
Beijing           China
Pretoria   South Africa

In [25]:
df3={'country':country,'capital':capital,'area':area,'population':population}

In [26]:
df4=pd.DataFrame(data=df3)

In [27]:
df4

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [28]:
df4['capital']

0     Brasilia
1       Moscow
2    New Delhi
3      Beijing
4     Pretoria
Name: capital, dtype: object

In [29]:
df4.describe()

            area   population
count   5.000000     5.000000
mean    8.310400   346.640000
std     5.762066   511.167158
min     2.980000     4.300000
25%     3.286000   133.000000
50%     8.516000   143.500000
75%     9.670000   200.400000
max    17.100000  1252.000000

In [30]:
df4.shape

(5, 4)

In [31]:
df4.index

RangeIndex(start=0, stop=5, step=1)

In [32]:
df4.index=['A','B','C','D','E']

In [33]:
df4

        country    capital    area  population
A        Brazil   Brasilia   8.516       200.4
B        Russia     Moscow  17.100       143.5
C         India  New Delhi   3.286      1252.0
D         China    Beijing   9.670       133.0
E  South Africa   Pretoria   2.980         4.3

In [34]:
df4.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [35]:
df4.index=range(1,10,2)

In [36]:
df4

        country    capital    area  population
1        Brazil   Brasilia   8.516       200.4
3        Russia     Moscow  17.100       143.5
5         India  New Delhi   3.286      1252.0
7         China    Beijing   9.670       133.0
9  South Africa   Pretoria   2.980         4.3

In [37]:
df4.index

RangeIndex(start=1, stop=10, step=2)

In [38]:
df4.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [39]:
df4.dtypes

country        object
capital        object
area          float64
population    float64
dtype: object

In [40]:
df4.area.max()

17.1

In [41]:
df4.reset_index()

   index       country    capital    area  population
0      1        Brazil   Brasilia   8.516       200.4
1      3        Russia     Moscow  17.100       143.5
2      5         India  New Delhi   3.286      1252.0
3      7         China    Beijing   9.670       133.0
4      9  South Africa   Pretoria   2.980         4.3

In [42]:
df4

        country    capital    area  population
1        Brazil   Brasilia   8.516       200.4
3        Russia     Moscow  17.100       143.5
5         India  New Delhi   3.286      1252.0
7         China    Beijing   9.670       133.0
9  South Africa   Pretoria   2.980         4.3

In [61]:
df4.reset_index(inplace=True)

In [86]:
df4

   index       country    capital    area  population
0      0        Brazil   Brasilia   8.516       200.4
1      1        Russia     Moscow  17.100       143.5
2      2         India  New Delhi   3.286      1252.0
3      3         China    Beijing   9.670       133.0
4      4  South Africa   Pretoria   2.980         4.3

In [63]:
df5=df4.rename(columns={"country":"count","area":"ar"})  ## same can be done for index or both.

In [80]:
df5

          count    capital      ar  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [81]:
df6=df5.reset_index()

In [85]:
df6

          count    capital      ar  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [88]:
df4.drop(labels=["index"], axis=1,inplace=True)

KeyError: "['index'] not found in axis"

#####

In [90]:
pd.__version__

'2.0.3'

In [1]:
import pandas as pd

In [2]:
game=pd.read_csv("vgsalesGlobale.csv")

In [3]:
game

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [4]:
game.dtypes

Rank              int64
Name             object
Platform         object
Year            float64
Genre            object
Publisher        object
NA_Sales        float64
EU_Sales        float64
JP_Sales        float64
Other_Sales     float64
Global_Sales    float64
dtype: object

In [5]:
game.Genre

0              Sports
1            Platform
2              Racing
3              Sports
4        Role-Playing
             ...
16593        Platform
16594         Shooter
16595          Racing
16596          Puzzle
16597        Platform
Name: Genre, Length: 16598, dtype: object

In [6]:
game['Genre']

0              Sports
1            Platform
2              Racing
3              Sports
4        Role-Playing
             ...
16593        Platform
16594         Shooter
16595          Racing
16596          Puzzle
16597        Platform
Name: Genre, Length: 16598, dtype: object

In [7]:
game.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [8]:
game.Genre.describe()

count      16598
unique        12
top       Action
freq        3316
Name: Genre, dtype: object

In [9]:
game.JP_Sales

0         3.77
1         6.81
2         3.79
3         3.28
4        10.22
         ...
16593     0.00
16594     0.00
16595     0.00
16596     0.00
16597     0.00
Name: JP_Sales, Length: 16598, dtype: float64

game.JP_Sales.describe()

In [10]:
game.JP_Sales.describe()

count    16598.000000
mean         0.077782
std          0.309291
min          0.000000
25%          0.000000
50%          0.000000
75%          0.040000
max         10.220000
Name: JP_Sales, dtype: float64

In [11]:
game.Genre.value_counts()

Genre
Action          3316
Sports          2346
Misc            1739
Role-Playing    1488
Shooter         1310
Adventure       1286
Racing          1249
Platform         886
Simulation       867
Fighting         848
Strategy         681
Puzzle           582
Name: count, dtype: int64

In [12]:
game.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [13]:
game.tail

<bound method NDFrame.tail of         Rank                                              Name Platform  \
0          1                                        Wii Sports      Wii
1          2                                 Super Mario Bros.      NES
2          3                                    Mario Kart Wii      Wii
3          4                                 Wii Sports Resort      Wii
4          5                          Pokemon Red/Pokemon Blue       GB
...      ...                                               ...      ...
16593  16596                Woody Woodpecker in Crazy Castle 5      GBA
16594  16597                     Men in Black II: Alien Escape       GC
16595  16598  SCORE International Baja 1000: The Official Game      PS2
16596  16599                                        Know How 2       DS
16597  16600                                  Spirits & Spells      GBA

         Year         Genre   Publisher  NA_Sales  EU_Sales  JP_Sales  \
0      2006.0        Sports    Nintendo     41.49     29.02      3.77
1      1985.0      Platform    Nintendo     29.08      3.58      6.81
2      2008.0        Racing    Nintendo     15.85     12.88      3.79
3      2009.0        Sports    Nintendo     15.75     11.01      3.28
4      1996.0  Role-Playing    Nintendo     11.27      8.89     10.22
...       ...           ...         ...       ...       ...       ...
16593  2002.0      Platform       Kemco      0.01      0.00      0.00
16594  2003.0       Shooter  Infogrames      0.01      0.00      0.00
16595  2008.0        Racing  Activision      0.00      0.00      0.00
16596  2010.0        Puzzle    7G//AMES      0.00      0.01      0.00
16597  2003.0      Platform     Wanadoo      0.01      0.00      0.00

       Other_Sales  Global_Sales
0             8.46         82.74
1             0.77         40.24
2             3.31         35.82
3             2.96         33.00
4             1.00         31.37
...            ...           ...
16593         0.00          0.01
16594         0.00          0.01
16595         0.00          0.01
16596         0.00          0.01
16597         0.00          0.01

[16598 rows x 11 columns]>

In [14]:
game.shape

(16598, 11)

In [16]:
game.Genre.value_counts()

Genre
Action          3316
Sports          2346
Misc            1739
Role-Playing    1488
Shooter         1310
Adventure       1286
Racing          1249
Platform         886
Simulation       867
Fighting         848
Strategy         681
Puzzle           582
Name: count, dtype: int64